In [2]:
import pandas as pd
import numpy as np

In [3]:
ind_we = pd.DataFrame({
    "city": ["mumbai", "delhi", "banglore"],
    "temp": [32, 45, 30],
    "hum":[80, 60, 78]
})

ind_we.head()

       city  temp  hum
0    mumbai    32   80
1     delhi    45   60
2  banglore    30   78

In [4]:
us_we = pd.DataFrame({
    "city": ["new york", "chicago", "orlando"],
    "temp": [56, 45, 34],
    "hum":[56, 23, 56]
})

us_we

       city  temp  hum
0  new york    56   56
1   chicago    45   23
2   orlando    34   56

In [7]:
df = pd.concat([ind_we, us_we])
df

       city  temp  hum
0    mumbai    32   80
1     delhi    45   60
2  banglore    30   78
0  new york    56   56
1   chicago    45   23
2   orlando    34   56

In [8]:
# in the above dataframe we can see
# indexing is not in proper form like continious
#to fix it we can use this

In [10]:
df = pd.concat([ind_we, us_we], ignore_index = True)
df

       city  temp  hum
0    mumbai    32   80
1     delhi    45   60
2  banglore    30   78
3  new york    56   56
4   chicago    45   23
5   orlando    34   56

In [11]:
# concatenation and keys

In [12]:
df = pd.concat([ind_we, us_we], keys = ["india", "us"])
df

             city  temp  hum
india 0    mumbai    32   80
      1     delhi    45   60
      2  banglore    30   78
us    0  new york    56   56
      1   chicago    45   23
      2   orlando    34   56

In [13]:
df.loc["us"]

       city  temp  hum
0  new york    56   56
1   chicago    45   23
2   orlando    34   56

In [14]:
df.loc["india"]

       city  temp  hum
0    mumbai    32   80
1     delhi    45   60
2  banglore    30   78

In [15]:
# concatenation using index

In [18]:
temp_df = pd.DataFrame({
    "city":["mumbai","delhi", "banglore"],
    "temp":[54, 45, 45]
}, index = [0, 1, 2])
temp_df

       city  temp
0    mumbai    54
1     delhi    45
2  banglore    45

In [19]:
wind_df = pd.DataFrame({
    "city":["delhi", "mumbai"],
    "windspeed":[5, 6]
}, index = [0, 1])
wind_df

     city  windspeed
0   delhi          5
1  mumbai          6

In [21]:
df1 = pd.concat([temp_df, wind_df], axis = 0)
df1

       city  temp  windspeed
0    mumbai  54.0        NaN
1     delhi  45.0        NaN
2  banglore  45.0        NaN
0     delhi   NaN        5.0
1    mumbai   NaN        6.0

In [24]:
df1 = pd.concat([temp_df, wind_df], axis = 1)
df1

       city  temp    city  windspeed
0    mumbai    54   delhi        5.0
1     delhi    45  mumbai        6.0
2  banglore    45     NaN        NaN

In [25]:
# concatenation dataframe with series

In [27]:
s = pd.Series(["humid", "dry", "rain"], name = "event")
s

0    humid
1      dry
2     rain
Name: event, dtype: object

In [29]:
df2 = pd.concat([temp_df, s], axis = 1)
df2

       city  temp  event
0    mumbai    54  humid
1     delhi    45    dry
2  banglore    45   rain